---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
---
⌛ 3. Решение потери контекста через `.bind`
```javascript
const obj = {
  name: "Frontend",
  showThis() {
    console.log(this.name);
  }
};
const bound = obj.showThis.bind(obj);
bound();
```
🎯 Решение:
Выведет: `"Frontend"`.
Объяснение:
Метод `.bind(obj)` создает новую функцию, где `this` всегда будет ссылаться на переданный объект.
---------------------------------------------------------------------------------------------
