---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
---
⌛ 7. Разница между `.call` и `.apply`
```javascript
function greet(greeting) {
  console.log(`${greeting}, ${this.name}`);
}
const obj = { name: "Frontend" };
greet.call(obj, "Hello");
greet.apply(obj, ["Hello"]);
```
🎯 Решение:
Оба вызова выведут: `"Hello, Frontend"`.
Объяснение:
Разница в способе передачи аргументов: `.call` принимает их по одному, а `.apply` — в массиве.
---------------------------------------------------------------------------------------------
