---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
---  
⌛ 8. Использование `bind` с аргументами
```javascript
function greet(greeting) {
  console.log(`${greeting}, ${this.name}`);
}
const obj = { name: "Frontend" };
const bound = greet.bind(obj, "Hello");
bound();
```
🎯 Решение:
Выведет: `"Hello, Frontend"`.
Объяснение:
`bind` создает новую функцию с привязанным контекстом и фиксированными аргументами.
---------------------------------------------------------------------------------------------
