---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
---
⌛ 11. Исправление через `bind` в классе
```javascript
class Counter {
  count = 0;
  increment = this.increment.bind(this);
  increment() {
    console.log(this.count++);
  }
}
const counter = new Counter();
counter.increment();
```
🎯 Решение:
Выведет: `0`.
Объяснение:
Использование `bind` привязывает метод к текущему объекту.
---------------------------------------------------------------------------------------------
