---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
---
⌛ 12. Контекст в обработчиках событий
```javascript
const button = document.createElement("button");
button.textContent = "Click me";
button.onclick = function () {
  console.log(this);
};
document.body.appendChild(button);
```
🎯 Решение:
Выведет: `<button>`.
Объяснение:
В обработчике событий `this` указывает на элемент, на котором произошло событие.
---------------------------------------------------------------------------------------------
