---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
--- 
⌛ 14. Использование `this` в `setTimeout`
```javascript
const obj = {
  name: "Frontend",
  showThis() {
    setTimeout(function () {
      console.log(this.name);
    }, 1000);
  }
};
obj.showThis();
```
🎯 Решение:
Выведет: `undefined`.
Объяснение:
Внутри функции `setTimeout`, `this` указывает на глобальный объект.
---------------------------------------------------------------------------------------------
