---------------------------------------------------------------------------------------------
⋙ ❍ Контекст вызова:
--- 
⌛ 15. Исправление через стрелочную функцию в `setTimeout`
```javascript
const obj = {
  name: "Frontend",
  showThis() {
    setTimeout(() => {
      console.log(this.name);
    }, 1000);
  }
};
obj.showThis();
```
🎯 Решение:
Выведет: `"Frontend"`.
Объяснение:
Стрелочная функция наследует `this` от внешнего контекста.
---------------------------------------------------------------------------------------------
