---------------------------------------------------------------------------------------------
⋙ ❍ Современные стандарты JavaScript (ES6+):
--- 
7. Промисы (Promises)
Промисы предоставляют способ работы с асинхронными операциями.
```javascript
const fetchData = new Promise((resolve, reject) => {
  const data = { name: 'Alice' };
  resolve(data);
});

fetchData
  .then(data => console.log(data)) // { name: 'Alice' }
  .catch(error => console.log(error));
```
Особенности:
- Промисы помогают работать с асинхронным кодом и улучшать читаемость.
- Методы `.then()` и `.catch()` для обработки результата и ошибок.
---------------------------------------------------------------------------------------------
