---------------------------------------------------------------------------------------------
⋙ ❍ Современные стандарты JavaScript (ES6+):
--- 
9. Дефолтные параметры функции
ES6 добавил возможность задавать значения по умолчанию для параметров функции.
```javascript
function greet(name = 'Guest') {
  console.log(`Hello, ${name}`);
}

greet(); // "Hello, Guest"
greet('Alice'); // "Hello, Alice"
```
Особенности:
- Если аргумент не передан, будет использовано значение по умолчанию.
---------------------------------------------------------------------------------------------
