---------------------------------------------------------------------------------------------
⋙ ❍ Современные стандарты JavaScript (ES6+):
--- 
13. `Array.includes`
Метод `includes` позволяет проверить, содержится ли элемент в массиве.
```javascript
const arr = [1, 2, 3];
console.log(arr.includes(2)); // true
console.log(arr.includes(4)); // false
```
Особенности:
- Метод возвращает `true`, если элемент найден, и `false`, если нет.
---------------------------------------------------------------------------------------------
