---------------------------------------------------------------------------------------------
⋙ ❍ Современные стандарты JavaScript (ES6+):
---
15. `Promise.finally`
Метод `finally` выполняется после успешного выполнения или отклонения промиса, не зависимо от результата.
```javascript
fetchData()
  .then(data => console.log(data))
  .catch(error => console.error(error))
  .finally(() => console.log('Request completed'));
```
---------------------------------------------------------------------------------------------
