---------------------------------------------------------------------------------------------
⋙ ❍ Современные стандарты JavaScript (ES6+):
---
17. Использование стрелочных функций
⌛ Задача: Напишите функцию, которая принимает два аргумента и возвращает их сумму, используя стрелочную функцию.
🎯 Решение:
```javascript
const sum = (a, b) => a + b;

console.log(sum(3, 5)); // 8
```
Объяснение:
- Стрелочные функции имеют более короткий синтаксис, чем обычные функции, и не имеют собственного контекста `this`.
---------------------------------------------------------------------------------------------
