---------------------------------------------------------------------------------------------  
⋙ ❍ Объекты:
---
9. Инвертировать ключи и значения в объекте
⌛ Задача: Напишите функцию, которая меняет местами ключи и значения в объекте.
Пример:
```javascript
const obj = { a: 1, b: 2, c: 3 };
invertObject(obj); // { "1": "a", "2": "b", "3": "c" }
```
🎯 Решение:
```javascript
const invertObject = (obj) => {
  return Object.fromEntries(Object.entries(obj).map(([key, value]) => [value, key]));
};
```
Сложность: O(n).
---------------------------------------------------------------------------------------------  
