---------------------------------------------------------------------------------------------  
⋙ ❍ Объекты:
---
27. Сравнение двух объектов
⌛ Задача: Напишите функцию для сравнения двух объектов на равенство.
🎯 Решение:
```javascript
function objectsEqual(obj1, obj2) {
  return JSON.stringify(obj1) === JSON.stringify(obj2);
}

const obj1 = { a: 1, b: 2 };
const obj2 = { a: 1, b: 2 };
console.log(objectsEqual(obj1, obj2)); // true
```
Объяснение:
- Сравниваем объекты, преобразуя их в строки с помощью `JSON.stringify()`.
---------------------------------------------------------------------------------------------  
