---------------------------------------------------------------------------------------------  
⋙ ❍ Изменение атрибутов:
---
1. Получение значения атрибута
⌛ Задача: Получите значение атрибута `data-info` у элемента.
🎯 Решение:
```javascript
const element = document.querySelector('div');
const dataInfo = element.getAttribute('data-info');

console.log(dataInfo);
```
Объяснение: Метод `getAttribute` возвращает значение указанного атрибута.
---------------------------------------------------------------------------------------------  
