---------------------------------------------------------------------------------------------  
⋙ ❍ Изменение атрибутов:
---
2. Удаление атрибута
⌛ Задача: Удалите атрибут `disabled` у кнопки.
🎯 Решение:
```javascript
const button = document.querySelector('button');
button.removeAttribute('disabled');

console.log(button.hasAttribute('disabled')); // false
```
Объяснение: Метод `removeAttribute` удаляет указанный атрибут.
--------------------------------------------------------------------------------------------- 
