---------------------------------------------------------------------------------------------  
⋙ ❍ Изменение атрибутов:
---
6. Удаление атрибута через `dataset`
⌛ Задача: Удалите атрибут `data-status`.
🎯 Решение:
```javascript
const element = document.querySelector('div');
delete element.dataset.status;

console.log(element.hasAttribute('data-status')); // false
```
Объяснение: С помощью `delete` можно удалить `data-*` атрибут.
---------------------------------------------------------------------------------------------  
