---------------------------------------------------------------------------------------------  
⋙ ❍ Изменение атрибутов:
---
14. Изменение атрибута через ссылку
⌛ Задача: Измените значение ссылки (`href`) у тега `<a>`.
🎯 Решение:
```javascript
const link = document.querySelector('a');
link.setAttribute('href', 'https://example.com');

console.log(link.href); // "https://example.com"
```
Объяснение: `setAttribute` изменяет значение атрибутов тега.
---------------------------------------------------------------------------------------------  
