---------------------------------------------------------------------------------------------  
⋙ ❍ Изменение атрибутов:
---
16. Чтение и изменение `checked` у чекбокса
⌛ Задача: Установите флажок у чекбокса.
🎯 Решение:
```javascript
const checkbox = document.querySelector('input[type="checkbox"]');
checkbox.checked = true;

console.log(checkbox.checked); // true
```
Объяснение: Свойство `checked` позволяет управлять состоянием флажка.
---------------------------------------------------------------------------------------------  

