---------------------------------------------------------------------------------------------
⋙ ❍ Замыкания:
---------------
⌛ Задача 2: Задержка вывода
Напишите функцию, которая с задержкой выведет числа от 1 до 5, используя замыкания.
🎯 Решение:
```javascript
function delayedLog() {
  for (let i = 1; i <= 5; i++) {
    setTimeout(function () {
      console.log(i);
    }, i * 1000);
  }
}

delayedLog();
```
Объяснение:
- В данном решении используется `let` для создания блоковой области видимости переменной `i`.
- Если использовать `var`, нужно обернуть `setTimeout` в функцию, чтобы замыкание захватывало правильное значение `i`:
  ```javascript
  function delayedLog() {
    for (var i = 1; i <= 5; i++) {
      (function (num) {
        setTimeout(function () {
          console.log(num);
        }, num * 1000);
      })(i);
    }
  }

  delayedLog();
  ```
---------------------------------------------------------------------------------------------
