---------------------------------------------------------------------------------------------  
⋙ ❍ Стрелочные функции:
---  
2. Использование с `map`
⌛ Задача: Преобразуйте массив чисел, удвоив каждое значение.
🎯 Решение:
```javascript
const nums = [1, 2, 3];
const doubled = nums.map(num => num * 2);

console.log(doubled); // [2, 4, 6]
```
Объяснение: Стрелочные функции удобно использовать в методах высшего порядка, таких как `map`.
---------------------------------------------------------------------------------------------  
