---------------------------------------------------------------------------------------------  
⋙ ❍ Стрелочные функции:
--- 
6. Контекст `this`
⌛ Задача: Что выведет код?
```javascript
const obj = {
  name: "Frontend",
  greet: function() {
    const arrow = () => console.log(this.name);
    arrow();
  }
};

obj.greet(); // ?
```
🎯 Решение:
```
"Frontend"
```
Объяснение: Стрелочные функции не имеют собственного `this`. Они наследуют его из окружающего контекста.
---------------------------------------------------------------------------------------------  
