---------------------------------------------------------------------------------------------  
⋙ ❍ Стрелочные функции:
--- 
8. Использование с `reduce`
⌛ Задача: Найдите сумму всех чисел в массиве.
🎯 Решение:
```javascript
const nums = [1, 2, 3, 4];
const sum = nums.reduce((acc, num) => acc + num, 0);

console.log(sum); // 10
```
Объяснение: Стрелочные функции часто применяются в методе `reduce` для упрощения кода.
---------------------------------------------------------------------------------------------  
