---------------------------------------------------------------------------------------------  
⋙ ❍ Стрелочные функции:
---  
12. Передача стрелочных функций
⌛ Задача: Используйте стрелочную функцию для сортировки массива по убыванию.
🎯 Решение:
```javascript
const nums = [1, 4, 2, 3];
nums.sort((a, b) => b - a);

console.log(nums); // [4, 3, 2, 1]
```
Объяснение: Стрелочные функции часто используются в `sort` для определения порядка сортировки.
--------------------------------------------------------------------------------------------- 
