---------------------------------------------------------------------------------------------  
⋙ ❍ Работа с DOM:
-----
1. По имени класса
Метод `document.getElementsByClassName()` возвращает HTMLCollection всех элементов с определённым классом.
```javascript
const elements = document.getElementsByClassName('myClass');
console.log(elements); // HTMLCollection
```
Объяснение: Возвращает "живую" коллекцию элементов.
--------------------------------------------------------------------------------------------- 
