---------------------------------------------------------------------------------------------  
⋙ ❍ Работа с DOM:
-----
2. По имени тега
Метод `document.getElementsByTagName()` возвращает все элементы с указанным тегом.
```javascript
const elements = document.getElementsByTagName('div');
console.log(elements); // HTMLCollection
```
Объяснение: Используется для выбора всех элементов определённого тега.
---------------------------------------------------------------------------------------------  
