---------------------------------------------------------------------------------------------  
⋙ ❍ Работа с DOM:
-----
4. Множественный выбор с querySelectorAll
Метод `document.querySelectorAll()` возвращает статический NodeList всех элементов, соответствующих CSS-селектору.
```javascript
const elements = document.querySelectorAll('.myClass');
console.log(elements); // NodeList
```
Объяснение: Удобен для работы с группой элементов.
---------------------------------------------------------------------------------------------  
