---------------------------------------------------------------------------------------------  
⋙ ❍ Сортировки:
---
10. Сортировка массива с использованием алгоритма пузырьковой сортировки
⌛ Задача: Реализуйте пузырьковую сортировку.
🎯 Решение:
```javascript
function bubbleSort(arr) {
  const n = arr.length;
  for (let i = 0; i < n; i++) {
    for (let j = 0; j < n - i - 1; j++) {
      if (arr[j] > arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]]; // обмен
      }
    }
  }
  return arr;
}

const numbers = [5, 2, 9, 1, 5, 6];
console.log(bubbleSort(numbers)); // [1, 2, 5, 5, 6, 9]
```
Объяснение:
- Пузырьковая сортировка повторно перебирает массив и меняет элементы местами, если они находятся в неправильном порядке.
---------------------------------------------------------------------------------------------  
