---------------------------------------------------------------------------------------------  
⋙ ❍ Сортировки:
---
13. Сортировка массива с использованием сортировки выбором
⌛ Задача: Реализуйте сортировку выбором.
🎯 Решение:
```javascript
function selectionSort(arr) {
  const n = arr.length;
  for (let i = 0; i < n - 1; i++) {
    let minIndex = i;
    for (let j = i + 1; j < n; j++) {
      if (arr[j] < arr[minIndex]) {
        minIndex = j;
      }
    }
    [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]]; // обмен
  }
  return arr;
}

const numbers = [5, 2, 9, 1, 5, 6];
console.log(selectionSort(numbers)); // [1, 2, 5, 5, 6, 9]
```
Объяснение:
- Мы находим минимальный элемент в оставшейся части массива и меняем его местами с первым элементом не отсортированной части массива.
---------------------------------------------------------------------------------------------  
