---------------------------------------------------------------------------------------------  
⋙ ❍ Сортировки:
---
15. Сортировка массива по датам
⌛ Задача: Напишите функцию, которая сортирует массив объектов по датам.
🎯 Решение:
```javascript
function sortByDate(arr) {
  return arr.sort((a, b) => new Date(a.date) - new Date(b.date));
}

const events = [
  { name: 'Event 1', date: '2022-01-01' },
  { name: 'Event 2', date: '2023-01-01' },
  { name: 'Event 3', date: '2021-01-01' }
];

console.log(sortByDate(events)); // Сортировка по дате
```
Объяснение:
- Сравниваем даты, преобразованные в объект `Date`.
---------------------------------------------------------------------------------------------  
