---------------------------------------------------------------------------------------------  
⋙ ❍ Event Loop:
---
1. `Promise` vs `setTimeout`
⌛ Задача: Что выведет код?
```javascript
setTimeout(() => console.log("Timeout"), 0);
Promise.resolve().then(() => console.log("Promise"));
console.log("End");
```
🎯 Решение:
```
End
Promise
Timeout
```
Объяснение: `Promise.then` попадает в микротаски, которые выполняются перед макротасками (например, `setTimeout`).
---------------------------------------------------------------------------------------------
