---------------------------------------------------------------------------------------------  
⋙ ❍ Event Loop:
---
3. Очередность `setTimeout`
⌛ Задача: Что выведет код?
```javascript
setTimeout(() => console.log("Timeout 1"), 100);
setTimeout(() => console.log("Timeout 2"), 50);
setTimeout(() => console.log("Timeout 3"), 0);
```
🎯 Решение:
```
Timeout 3
Timeout 2
Timeout 1
```
Объяснение: Таймауты с меньшим временем выполняются раньше.
---------------------------------------------------------------------------------------------
