---------------------------------------------------------------------------------------------  
⋙ ❍ Event Loop:
--- 
15. Очередь из микротасок
⌛ Задача: Что выведет код?
```javascript
Promise.resolve()
  .then(() => {
    console.log("Promise 1");
    Promise.resolve().then(() => console.log("Promise 2"));
  })
  .then(() => console.log("Promise 3"));
```
🎯 Решение:
```
Promise 1
Promise 2
Promise 3
```
Объяснение: Вложенный `then` добавляет микротаску в очередь.
---------------------------------------------------------------------------------------------
