---------------------------------------------------------------------------------------------  
⋙ ❍ Задача на eventLoop:
---
17. Различие между `setTimeout` и `setImmediate`
⌛ Задача: Напишите код, который использует и `setTimeout()`, и `setImmediate()`, и объясните порядок их выполнения.
🎯 Решение:
```javascript
console.log("Start");

setTimeout(() => {
  console.log("setTimeout");
}, 0);

setImmediate(() => {
  console.log("setImmediate");
});

console.log("End");
```
Объяснение:
- `setTimeout()` с задержкой 0 миллисекунд будет выполнен в макрозадаче после завершения текущего кода.
- `setImmediate()` будет выполнен в следующем цикле Event Loop, но после всех микрозадач.
- Порядок вывода будет:
  1. "Start"
  2. "End"
  3. "setImmediate"
  4. "setTimeout"
---------------------------------------------------------------------------------------------  
