---------------------------------------------------------------------------------------------  
⋙ ❍ Задача на eventLoop:
---
21. Что будет выведено в консоль?
⌛ Задача: Напишите код, который использует микрозадачи и макрозадачи, и объясните, что будет выведено в консоль.
🎯 Решение:
```javascript
console.log("Start");

setTimeout(() => {
  console.log("setTimeout");
}, 0);

Promise.resolve().then(() => {
  console.log("Promise");
});

console.log("End");
```
Объяснение:
- Порядок вывода:
  1. "Start"
  2. "End"
  3. "Promise" (микрозадача)
  4. "setTimeout" (макрозадача)
---------------------------------------------------------------------------------------------  
