---------------------------------------------------------------------------------------------  
⋙ ❍ Задача на eventLoop:
---
30. Важность использования `async/await` внутри цикла
⌛ Задача: Напишите асинхронную функцию с циклом, который использует `await`.
🎯 Решение:
```javascript
async function asyncLoop() {
  const values = [1, 2, 3];

  for (const value of values) {
    await new Promise(resolve => setTimeout(() => resolve(value), 1000));
    console.log(value);
  }
}

asyncLoop();
```

Объяснение:
- Используем `await` внутри цикла, чтобы каждая итерация ожидала завершения предыдущей.
---------------------------------------------------------------------------------------------  
