---------------------------------------------------------------------------------------------  
⋙ ❍ Задача на eventLoop:
---
32. Использование `Promise.race()` для выбора первого завершившегося промиса
⌛ Задача: Напишите код, который использует `Promise.race()` и выбирает первый завершившийся промис.
🎯 Решение:
```javascript
const promise1 = new Promise(resolve => setTimeout(resolve, 1000, 'First'));
const promise2 = new Promise(resolve => setTimeout(resolve, 500, 'Second'));

Promise.race([promise1, promise2]).then(result => {
  console.log(result); // 'Second'
});
```
Объяснение:
- `Promise.race()` возвращает первый завершившийся промис, независимо от того, успешно он завершился или нет.
---------------------------------------------------------------------------------------------  
