---------------------------------------------------------------------------------------------
⋙ ❍ async/await:
---
15. Асинхронный таймер
⌛ Задача: Напишите асинхронный таймер с использованием `async/await`.
🎯 Решение:
```javascript
async function timer(seconds) {
  for (let i = seconds; i >= 0; i--) {
    console.log(i);
    await new Promise(resolve => setTimeout(resolve, 1000));
  }
}

timer(5); // 5, 4, 3, 2, 1, 0
```
---------------------------------------------------------------------------------------------
