---------------------------------------------------------------------------------------------
⋙ ❍ Работа с this:
---
1. Метод объекта
⌛ Задача: Что выведет код?
```javascript
const obj = {
  name: "Frontend",
  showThis: function() {
    console.log(this.name);
  }
};
obj.showThis();
```
🎯 Решение:
```javascript
"Frontend"
```
Объяснение:
При вызове метода объекта значение `this` ссылается на сам объект, в данном случае `obj`.
---------------------------------------------------------------------------------------------
