---------------------------------------------------------------------------------------------
⋙ ❍ Работа с this:
---
3. Стрелочная функция внутри метода
⌛ Задача: Что выведет этот код?
```javascript
const obj = {
  name: "Frontend",
  showThis: function() {
    const arrowFunc = () => console.log(this.name);
    arrowFunc();
  }
};
obj.showThis();
```
🎯 Решение:
```javascript
"Frontend"
```
Объяснение: Стрелочная функция не имеет собственного `this` и использует значение `this` внешнего контекста.
---------------------------------------------------------------------------------------------
