---------------------------------------------------------------------------------------------
⋙ ❍ Работа с this:
---
5. this в конструкторе
⌛ Задача: Что выведет этот код?
```javascript
function User(name) {
  this.name = name;
}
const user = new User("Frontend");
console.log(user.name);
```
🎯 Решение:
```javascript
"Frontend"
```
Объяснение: При вызове функции с `new` создаётся новый объект, на который ссылается `this`.
---------------------------------------------------------------------------------------------
