---------------------------------------------------------------------------------------------
⋙ ❍ Работа с this:
---
7. Передача this через call
⌛ Задача: Что выведет код?
```javascript
function greet() {
  console.log(`Hello, ${this.name}`);
}
const user = { name: "Frontend" };
greet.call(user);
```
🎯 Решение:
```javascript
"Hello, Frontend"
```
Объяснение: Метод `call` позволяет вручную задать значение `this`.
---------------------------------------------------------------------------------------------
