---------------------------------------------------------------------------------------------
⋙ ❍ Работа с this:
---
9. this в классе
⌛ Задача: Что выведет код?
```javascript
class User {
  constructor(name) {
    this.name = name;
  }
  showThis() {
    console.log(this.name);
  }
}
const user = new User("Frontend");
user.showThis();
```
🎯 Решение:
```javascript
"Frontend"
```
Объяснение: `this` внутри метода класса указывает на экземпляр класса.
---------------------------------------------------------------------------------------------
