---------------------------------------------------------------------------------------------
⋙ ❍ Нужно сделать минипроект — список пользователей с формой создания/редактирования пользователя:?
---
16.
- Для хранения пользователей используйте Firebase (это бесплатно).
- Для стилизации используйте Bootstrap.
- Минимальный набор полей пользователя:
- имя;
- фамилия;
- электронная почта;
- телефон (в формате +380 (XX) XXX-XX-XX)
- дата рождения;
- будет плюсом добавление аватара и возможность crop-картинки.
- Список пользователей должен иметь возможность фильтрации и пагинацию.
- Проект должен содержать README-файл с шагами для запуска.
---------------------------------------------------------------------------------------------
