---------------------------------------------------------------------------------------------  
⋙ ❍ Методы, такие как map, reduce, filter, Object.keys:
---
5. Нахождение самого длинного слова в массиве
⌛ Задача: Напишите функцию, которая находит самое длинное слово в массиве.
Пример:
```javascript
const words = ['apple', 'banana', 'cherry', 'kiwi'];
longestWord(words); // 'banana'
```
🎯 Решение:
```javascript
const longestWord = (arr) => {
  return arr.reduce((longest, current) => current.length > longest.length ? current : longest, '');
};
```
Объяснение:
- Метод `reduce()` используется для сравнения длины строк и нахождения самой длинной.
---------------------------------------------------------------------------------------------  
