---------------------------------------------------------------------------------------------   
⋙ ❍ Деструктуризация:
---
1. Простая деструктуризация массива
⌛ Задача: Извлеките первый и второй элементы массива.
🎯 Решение:
```javascript
const arr = [10, 20, 30];
const [first, second] = arr;

console.log(first); // 10
console.log(second); // 20
```
Объяснение: Индексы массива соответствуют переменным при деструктуризации.
--------------------------------------------------------------------------------------------- 
