---------------------------------------------------------------------------------------------   
⋙ ❍ Деструктуризация:
---
3. Пропуск элементов массива
⌛ Задача: Извлеките первый и третий элементы массива.
🎯 Решение:
```javascript
const arr = [10, 20, 30];
const [first, , third] = arr;

console.log(first); // 10
console.log(third); // 30
```
Объяснение: Используйте запятую, чтобы пропустить ненужные элементы.
--------------------------------------------------------------------------------------------- 
