---------------------------------------------------------------------------------------------   
⋙ ❍ Деструктуризация:
---
5. Деструктуризация вложенных объектов
⌛ Задача: Извлеките `city` из вложенного объекта.
🎯 Решение:
```javascript
const person = { name: "Alice", address: { city: "London" } };
const { address: { city } } = person;

console.log(city); // "London"
```
Объяснение: Можно деструктурировать вложенные объекты, используя такую же структуру.
--------------------------------------------------------------------------------------------- 
