---------------------------------------------------------------------------------------------   
⋙ ❍ Деструктуризация:
---
16. Деструктуризация и переименование с массивами
⌛ Задача: Извлеките второй элемент массива и назовите его `second`.
🎯 Решение:
```javascript
const arr = [10, 20, 30];
const [, second] = arr;

console.log(second); // 20
```
Объяснение: Вы можете использовать деструктуризацию с переименованием и пропуском элементов.
--------------------------------------------------------------------------------------------- 
