---------------------------------------------------------------------------------------------  
⋙ ❍ Задания со строками + Примитивы:
---
9. Преобразование строки в строчные буквы
⌛ Задача: Напишите функцию, которая преобразует все буквы в строке в нижний регистр.
🎯 Решение:
```javascript
function toLowerCase(str) {
  return str.toLowerCase();
}

console.log(toLowerCase("HELLO")); // "hello"
```
Объяснение: Метод `toLowerCase()` преобразует все символы строки в нижний регистр.
---------------------------------------------------------------------------------------------  
