---------------------------------------------------------------------------------------------  
⋙ ❍ Задания с Примитивами:
---
22. Преобразование числа в строку
⌛ Задача: Напишите функцию, которая преобразует число в строку.
🎯 Решение:
```javascript
function numberToString(num) {
  return num.toString();
}

console.log(numberToString(123)); // "123"
```
Объяснение: Используем метод `toString()` для преобразования числа в строку.
---------------------------------------------------------------------------------------------    
