---------------------------------------------------------------------------------------------  
⋙ ❍ Задания с Примитивами:
---
25. Преобразование булевого значения в строку
⌛ Задача: Напишите функцию, которая преобразует булевое значение в строку.
🎯 Решение:
```javascript
function booleanToString(bool) {
  return bool.toString();
}

console.log(booleanToString(true)); // "true"
console.log(booleanToString(false)); // "false"
```
Объяснение: Используем метод `toString()` для преобразования булевого значения в строку.
---------------------------------------------------------------------------------------------   
