---------------------------------------------------------------------------------------------  
⋙ ❍ Задания с Примитивами:
---
32. Преобразование строки в массив символов
⌛ Задача: Напишите функцию, которая преобразует строку в массив символов.
🎯 Решение:
```javascript
function stringToCharArray(str) {
  return [...str];
}

console.log(stringToCharArray("Hello")); // ["H", "e", "l", "l", "o"]
```
Объяснение: Мы используем оператор расширения (`...`), чтобы преобразовать строку в массив символов.
--------------------------------------------------------------------------------------------- 
