---------------------------------------------------------------------------------------------
⋙ ❍ styled-components:
--- 
11. Стилизация по типу тега
⌛ Задача: Стилизуйте все `<h1>`.
🎯 Решение:
```javascript
const StyledH1 = styled.h1`
  color: red;
`;

const App = () => <StyledH1>Styled Heading</StyledH1>;

// Все h1 с использованием StyledH1 будут красными.
```
Объяснение: Вы можете стилизовать HTML-теги, используя `styled-components`.
---------------------------------------------------------------------------------------------
