--------------------------------------------------------------------------------------------- 
⋙ ❍ Решение практических задач по программированию:
---
19. Сумма чисел с использованием reduce
⌛ Задача: Напишите функцию, которая использует метод `reduce` для нахождения суммы двух чисел.
🎯 Решение:
```js
function sum(a, b) {
  return [a, b].reduce((acc, curr) => acc + curr, 0);
}

console.log(sum(5, 3)); // 8
```
Объяснение: Мы используем метод массива `reduce`, чтобы сложить два числа. Метод проходит по всем элементам массива и суммирует их.
Эти задачи на сумму двух чисел охватывают различные подходы и техники, такие как рекурсия, замыкания, использование стрелочных функций, проверка типов, работа с массивами и строками. Они позволяют попрактиковаться в решении различных типов задач на языке JavaScript.
--------------------------------------------------------------------------------------------- 
