--------------------------------------------------------------------------------------------- 
⋙ ❍ Решение практических задач по программированию:
---
29. Нахождение длины строки
⌛ Задача: Напишите функцию, которая находит длину строки.
🎯 Решение:
```js
function stringLength(str) {
  return str.length;
}

console.log(stringLength('hello')); // 5
```
Объяснение: Свойство `length` возвращает количество символов в строке.
---
--------------------------------------------------------------------------------------------- 
