---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
40. Переворот строки
⌛ Задача: Написать функцию, которая переворачивает строку.
🎯 Решение:
2.1. Метод `split()`, `reverse()` и `join()`
```javascript
function reverseString(str) {
    return str.split("").reverse().join("");
}

console.log(reverseString("hello")); // "olleh"
```
Объяснение:
- Разбиваем строку в массив (`split("")`), переворачиваем (`reverse()`), объединяем обратно (`join("")`).
- O(N).
---------------------------------------------------------------------------------------------  
