---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Написать функцию, которая переворачивает строку.
🎯 Решение:
2.2. Цикл `for`
```javascript
function reverseString(str) {
    let reversed = "";
    for (let i = str.length - 1; i >= 0; i--) {
        reversed += str[i];
    }
    return reversed;
}

console.log(reverseString("hello")); // "olleh"
```
Объяснение:
- Добавляем символы в новую строку в обратном порядке.
- O(N).
---------------------------------------------------------------------------------------------  
