---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Написать функцию, которая переворачивает строку.
🎯 Решение:
2.3. Рекурсия
```javascript
function reverseString(str) {
    return str.length <= 1 ? str : reverseString(str.slice(1)) + str[0];
}

console.log(reverseString("hello")); // "olleh"
```
Объяснение:
- Берем первый символ и перемещаем его в конец.
- O(N), но O(N) памяти из-за рекурсии.
---------------------------------------------------------------------------------------------  
