---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Написать функцию, которая переворачивает строку.
🎯 Решение:
2.4. Метод `reduce()`
```javascript
function reverseString(str) {
    return str.split("").reduce((rev, char) => char + rev, "");
}

console.log(reverseString("hello")); // "olleh"
```
Объяснение:
- Проходим по массиву и добавляем символы перед текущей строкой.
- O(N).
---------------------------------------------------------------------------------------------  
