---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Написать функцию, которая переворачивает строку.
🎯 Решение:
2.5. Деструктуризация с `map()`
```javascript
function reverseString(str) {
    return [...str].map((_, i, arr) => arr[arr.length - 1 - i]).join("");
}

console.log(reverseString("hello")); // "olleh"
```
Объяснение:
- Используем `map()` для перестановки элементов.
- O(N).
---------------------------------------------------------------------------------------------  
