---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти `n`-е число Фибоначчи.
🎯 Решение:
3.2. Мемоизация
```javascript
let memo = {};

function fibonacci(n) {
    if (n in memo) return memo[n];
    if (n <= 1) return n;
    return memo[n] = fibonacci(n - 1) + fibonacci(n - 2);
}

console.log(fibonacci(6)); // 8
```
Объяснение:
- Используем `memo` для кеширования.
- O(N).
---------------------------------------------------------------------------------------------  
