---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти `n`-е число Фибоначчи.
🎯 Решение:
3.3. Итеративный `for`
```javascript
function fibonacci(n) {
    let a = 0, b = 1;
    for (let i = 2; i <= n; i++) {
        [a, b] = [b, a + b];
    }
    return b;
}

console.log(fibonacci(6)); // 8
```
Объяснение:
- O(N), но без рекурсии.
---------------------------------------------------------------------------------------------  
