---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти `n`-е число Фибоначчи.
🎯 Решение:
3.4. Итеративный `while`
```javascript
function fibonacci(n) {
    let a = 0, b = 1, i = 2;
    while (i <= n) {
        [a, b] = [b, a + b];
        i++;
    }
    return b;
}

console.log(fibonacci(6)); // 8
```
Объяснение:
- Работает аналогично `for`.
--------------------------------------------------------------------------------------------- 
