---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти `n`-е число Фибоначчи.
🎯 Решение:
3.5. Формула Бине
```javascript
function fibonacci(n) {
    const sqrt5 = Math.sqrt(5);
    return Math.round((Math.pow(1 + sqrt5, n) - Math.pow(1 - sqrt5, n)) / (Math.pow(2, n) * sqrt5));
}

console.log(fibonacci(6)); // 8
```
Объяснение:
- Вычисляет за O(1), но могут быть ошибки округления.
--------------------------------------------------------------------------------------------- 
