---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Удалить повторяющиеся элементы в массиве и вернуть уникальные значения.
🎯 Решение:
5.4. Использование `Map`
```javascript
function removeDuplicates(arr) {
    let map = new Map();
    arr.forEach(item => map.set(item, true));
    return [...map.keys()];
}

console.log(removeDuplicates([1, 2, 2, 3, 4, 4, 5])); // [1, 2, 3, 4, 5]
```
Объяснение:
- `Map` сохраняет уникальные ключи.
- O(N).
---------------------------------------------------------------------------------------------  
