---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Удалить повторяющиеся элементы в массиве и вернуть уникальные значения.
🎯 Решение:
5.5. Использование `Object`
```javascript
function removeDuplicates(arr) {
    let obj = {};
    arr.forEach(item => obj[item] = true);
    return Object.keys(obj).map(Number);
}

console.log(removeDuplicates([1, 2, 2, 3, 4, 4, 5])); // [1, 2, 3, 4, 5]
```
Объяснение:
- Используем `Object`, чтобы хранить уникальные значения.
- O(N).
---------------------------------------------------------------------------------------------  
