---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти второй по величине элемент в массиве.
🎯 Решение:
6.4. `reduce()`
```javascript
function secondMax(arr) {
    let max = Math.max(...arr);
    return arr.reduce((secondMax, num) => (num !== max && num > secondMax ? num : secondMax), -Infinity);
}

console.log(secondMax([10, 20, 4, 45, 99, 99])); // 45
```
Объяснение:
- O(N), но не такой читаемый, как с `for`.
---------------------------------------------------------------------------------------------  
