---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Найти второй по величине элемент в массиве.
🎯 Решение:
6.5. Использование `Set` и `Math.max()`
```javascript
function secondMax(arr) {
    let unique = [...new Set(arr)];
    unique.splice(unique.indexOf(Math.max(...unique)), 1);
    return Math.max(...unique);
}

console.log(secondMax([10, 20, 4, 45, 99, 99])); // 45
```
Объяснение:
- Убираем дубликаты, удаляем максимальное число, ищем новый максимум.
- O(N).
---------------------------------------------------------------------------------------------  
