---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
65. Перестановка слов в предложении
⌛ Задача: Развернуть порядок слов в строке.
🎯 Решение:
7.1. `split()`, `reverse()` и `join()`
```javascript
function reverseWords(str) {
    return str.split(" ").reverse().join(" ");
}

console.log(reverseWords("hello world!")); // "world! hello"
```
Объяснение:
- Разбиваем строку в массив слов, переворачиваем, соединяем.
- O(N).
---------------------------------------------------------------------------------------------  
