---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Развернуть порядок слов в строке.
🎯 Решение:
7.2. `reduce()`
```javascript
function reverseWords(str) {
    return str.split(" ").reduce((rev, word) => word + " " + rev, "").trim();
}

console.log(reverseWords("hello world!")); // "world! hello"
```
Объяснение:
- `reduce()` добавляет слова в обратном порядке.
- O(N).
---------------------------------------------------------------------------------------------  
