---------------------------------------------------------------------------------------------  
⋙ ❍ Массивы:
---
⌛ Задача: Развернуть порядок слов в строке.
🎯 Решение:
7.5. Рекурсивное решение
```javascript
function reverseWords(str) {
    let words = str.split(" ");
    return words.length === 1 ? words[0] : reverseWords(words.slice(1).join(" ")) + " " + words[0];
}

console.log(reverseWords("hello world!")); // "world! hello"
```
Объяснение:
- Разбиваем строку и вызываем рекурсию.
- O(N).
---------------------------------------------------------------------------------------------
