---------------------------------------------------------------------------------------------
⋙ ❍ Работа с Promises (асинхронным кодом):
---
9. Создание задержки
⌛ Задача: Напишите функцию `delay`, которая возвращает промис, разрешающийся через заданное количество миллисекунд.
🎯 Решение:
```javascript
function delay(ms) {
  return new Promise(resolve => setTimeout(resolve, ms));
}

delay(1000).then(() => console.log("1 second passed"));
```
---------------------------------------------------------------------------------------------
