---------------------------------------------------------------------------------------------
⋙ ❍ Работа с Promises (асинхронным кодом):
---
10. Последовательное выполнение
⌛ Задача: Как выполнить промисы последовательно?
🎯 Решение:
```javascript
const tasks = [1, 2, 3];

tasks.reduce((promise, task) => {
  return promise.then(() => {
    console.log(task);
    return Promise.resolve();
  });
}, Promise.resolve());
```
Результат:
```
1
2
3
```
---------------------------------------------------------------------------------------------
