---------------------------------------------------------------------------------------------
⋙ ❍ Работа с Promises (асинхронным кодом):
---
16. Использование async/await
⌛ Задача: Напишите функцию, которая последовательно выполняет два промиса с использованием `async/await`.
🎯 Решение:
```javascript
async function execute() {
  const result1 = await Promise.resolve(1);
  console.log(result1);

  const result2 = await Promise.resolve(2);
  console.log(result2);
}

execute();
```
Результат:
```
1
2
```
---------------------------------------------------------------------------------------------

