---------------------------------------------------------------------------------------------  
⋙ ❍ React компоненты:
---
12. Условный рендеринг
⌛ Задача: Рендерьте текст в зависимости от условия.
🎯 Решение:
```jsx
function Greeting({ isLoggedIn }) {
  return <h1>{isLoggedIn ? "Welcome back!" : "Please sign in."}</h1>;
}

export default Greeting;
```
Объяснение: Условный рендеринг осуществляется через тернарный оператор.
---------------------------------------------------------------------------------------------  
