--------------------------------------------------------------------------------------------- 
⋙ ❍ Задача на асинхронность + eventLoop:
---
6. Понимание асинхронной очереди
⌛ Задача: Напишите код, который демонстрирует порядок выполнения задач, когда используются несколько промисов и таймеров.
🎯 Решение:
```javascript
console.log("Start");

setTimeout(() => {
  console.log("Timeout 1");
}, 0);

Promise.resolve().then(() => {
  console.log("Promise 1");
});

setTimeout(() => {
  console.log("Timeout 2");
}, 0);

Promise.resolve().then(() => {
  console.log("Promise 2");
});

console.log("End");
```
Объяснение: Порядок вывода будет следующим:
1. "Start"
2. "End"
3. "Promise 1"
4. "Promise 2"
5. "Timeout 1"
6. "Timeout 2"
---------------------------------------------------------------------------------------------
