--------------------------------------------------------------------------------------------- 
⋙ ❍ Задача на асинхронность + eventLoop:
---
12. Задержка выполнения с использованием `setTimeout`
⌛ Задача: Напишите код, который задерживает выполнение функции на 3 секунды.
🎯 Решение:
```javascript
setTimeout(() => {
  console.log("Executed after 3 seconds");
}, 3000);
```
Объяснение: Используем `setTimeout` для задержки выполнения кода.
--------------------------------------------------------------------------------------------- 
