--------------------------------------------------------------------------------------------- 
⋙ ❍ Задача на асинхронность + eventLoop:
---
13. Промис с таймаутом
⌛ Задача: Напишите функцию, которая возвращает промис, но с таймаутом на 3 секунды.
🎯 Решение:
```javascript
function timeoutPromise() {
  return new Promise((resolve, reject) => {
    setTimeout(() => {
      reject("Timed out");
    }, 3000);
  });
}

timeoutPromise().catch((err) => console.log(err)); // Timed out
```
Объяснение: Мы создаем промис, который отклоняется через 3 секунды.
--------------------------------------------------------------------------------------------- 
