---------------------------------------------------------------------------------------------  
⋙ ❍ Typescript:
---
1. Типизация функции
⌛ Задача: Напишите функцию, которая принимает два числа и возвращает их сумму.
🎯 Решение:
```typescript
function add(a: number, b: number): number {
  return a + b;
}

console.log(add(2, 3)); // 5
```
Объяснение: Указывается тип аргументов (`a: number, b: number`) и тип возвращаемого значения (`: number`).
---------------------------------------------------------------------------------------------  
