---------------------------------------------------------------------------------------------  
⋙ ❍ Typescript:
---
8. Интерфейс
⌛ Задача: Определите интерфейс для типизации объекта пользователя.
🎯 Решение:
```typescript
interface User {
  name: string;
  age: number;
}

const user: User = { name: "Alice", age: 30 };
console.log(user);
```
Объяснение: `interface` используется для описания структуры объекта.
---------------------------------------------------------------------------------------------  
