---------------------------------------------------------------------------------------------  
⋙ ❍ Typescript:
---
15. Типизация `React` компонента
⌛ Задача: Напишите функциональный компонент с типизацией пропсов.
🎯 Решение:
```typescript
import React from "react";

type Props = {
  name: string;
};

const Greeting: React.FC<Props> = ({ name }) => {
  return <h1>Hello, {name}!</h1>;
};

export default Greeting;
```
Объяснение: Используется `React.FC<Props>` для типизации пропсов.
---------------------------------------------------------------------------------------------  
