---------------------------------------------------------------------------------------------  
⋙ ❍ Методы, такие как map, reduce, filter, Object.keys:
---
2. Фильтрация чисел больше 10
⌛ Задача: Напишите функцию, которая фильтрует числа, большие 10, из массива.
Пример:
```javascript
const numbers = [5, 12, 8, 130, 44];
filterGreaterThanTen(numbers); // [12, 130, 44]
```
🎯 Решение:
```javascript
const filterGreaterThanTen = (arr) => {
  return arr.filter(num => num > 10);
};
```
Объяснение:
- Метод `filter()` используется для извлечения чисел, которые больше 10.
---------------------------------------------------------------------------------------------  
